{"data":{"site":{"siteMetadata":{"title":"Electric Sheep Blog","author":"takeshiino21","homepage":"https://github.com/t-keshi-inoue"}},"post":{"id":"df926084-13e5-5d92-b346-c4d4a04103c6","html":"<p>　RESTfulって何？って聞くと、<br>\nRESTがfulなことだよ！って答える。<br>\n木霊でしょうか？<br>\nいいえ、誰でも。。。</p>\n<h2>RESTfulとは何か</h2>\n<p>　RESTfulとはREST的であり、REST\bに満ちており、RESTが守られていることである。と聞いて、まったくわからなくなった私は「Webを支える技術」という本を手にとった。<br>\nRestとは日本語にすると休むこと、しかしRESTはそのRestではない。何この小ボケ。RESTはRepresentational State Transferの頭文字をとったものであり、無理やり日本語にすると「表現的状態転送」となるだろう。しかしRESTという名は、RESTのすべてを表した呼び名ではない。もう少し複雑なものなので詳しく見ていこう</p>\n<h2>RESTの歴史的背景</h2>\n<p>　各社が各々に全くバラバラのやり方でインターネットに向かっていると、いろいろと不便なことがあるよねってことで、Webの黎明期から、「あれは統一しとこう！」とか「これは揃えといたほうがよくね？」っていう話し合いが行われてきた。しかし、会社はみんな「自分の会社のやり方で統一したい！」と思っており、「みんなの利益のための話し合い」という大義名分で行われていもののその実は「熾烈を極める覇権争い」であった。</p>\n<p>　彼らは何を揃えたかったのだろう。それは、Webの最も基本的な構成というか、アーキテクチャーというか「Webはこういう仕組みで作るものだ！」というセオリーだった。この苛烈な争いの中、頭一つ抜けたのがSOAPというMicrosoftが提案したアーキテクチャーである。しかし仕様変更が多かったり複雑だったりしたという理由で、「あんま良くなくね？」という感じだったらしい。  </p>\n<p>　そんななか彗星のごとく現れたのがRESTだった。RESTは各社の覇権争いの外から突如としてやってきたもので、つまりはFieldingという名の一人の研究者が提案したやーつだ。MicroSoftみたいな大企業中の大企業、大御所から見たら、RESTなんか子供だましそのもの。\nおもちゃだという罵詈もあったらしい。が、蓋を開けてみればRESTが勝った。結局はシンプルなものが一番良いということなのかもしれない。</p>\n<p>　クラスとは「まとめるもの」であり、「まとめたものの例をつくるもの」。動物というクラス。そしてその犬という名の例、インスタンス。と考えるとわかりやすい。このとき犬は\b動物の中に「隠される」。野菜やそのインスタンス、キャベツは犬の存在を知らない。存在を知らないというのは言い換えれば独立しているということで、依存関係が減るほど、プログラミングは設計しやすくメンテナンスしやすい。隠れているのはむしろ都合がいいことなのだ。  </p>\n<h2>RESTの原則</h2>\n<p>　歴史的な説明はいいから、結局RESTってなんなの？とお思いになっただろうか。<br>\nRESTには、いくつかの主要な原則や仕組みがある。\nリソースの表現と状態、クライアント/サーバ、ステートレスサーバ、キャッシュ、統一インタフェース、階層化システム、コードオンデマンド\nなどがそれである。\nそれぞれ順にざっくり説明すると、\nURIでリソースを表現しようとか、クライアントとサーバーの２つに分けるシステムとか、サーバがアプリケーションの状態を持たないこととか、一度取得したデータはクライアント側で使い回すこととか、リソースに対する操作を統一したインタフェースで行うこととか、クライアントとサーバを上手いこと使って不可を分散させることとか、サーバでダウンロードしたコードをクライント側で実行することとかだ。このようにRESTはけっこう中身の濃いもので、一口にこれだ！と言いにくいのが難しい。一行でRESTを説明しろと言われたら、「RESTとはアーキテクチャーの１つだ！」と答える他ないだろう。</p>\n<p>以上、RESTfulとRESTについて。\nまだ良くわかったという気が正直しないのだが、とりあえずはここまで！</p>","frontmatter":{"title":"RESTfulって何がful?","path":"/post21/","images":["images/1.png"],"category":"other","tags":["other"],"date":"2019-11-20T00:00:00.000Z","components":null,"tweets":null,"summary":"RESTを詳解"}}},"pageContext":{"isCreatedByStatefulCreatePages":false}}